{"config": [{"config": {"filters": 32, "bias_regularizer": null, "strides": [1, 1], "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "trainable": true, "batch_input_shape": [null, 1, 28, 28], "data_format": "channels_first", "activity_regularizer": null, "activation": "relu", "padding": "valid", "name": "conv2d_3", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "dtype": "float32", "use_bias": true, "dilation_rate": [1, 1], "kernel_size": [3, 3], "bias_constraint": null}, "class_name": "Conv2D"}, {"config": {"filters": 32, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "dilation_rate": [1, 1], "trainable": true, "data_format": "channels_first", "activity_regularizer": null, "activation": "relu", "padding": "valid", "name": "conv2d_4", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "strides": [1, 1], "kernel_regularizer": null, "use_bias": true, "bias_regularizer": null, "kernel_size": [3, 3], "bias_constraint": null}, "class_name": "Conv2D"}, {"config": {"padding": "valid", "name": "max_pooling2d_2", "strides": [2, 2], "data_format": "channels_first", "trainable": true, "pool_size": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"noise_shape": null, "seed": null, "name": "dropout_3", "trainable": true, "rate": 0.25}, "class_name": "Dropout"}, {"config": {"name": "flatten_2", "trainable": true}, "class_name": "Flatten"}, {"config": {"kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "bias_constraint": null, "activity_regularizer": null, "activation": "relu", "name": "dense_3", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "units": 512, "use_bias": true, "bias_regularizer": null, "trainable": true}, "class_name": "Dense"}, {"config": {"noise_shape": null, "seed": null, "name": "dropout_4", "trainable": true, "rate": 0.5}, "class_name": "Dropout"}, {"config": {"kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "bias_constraint": null, "activity_regularizer": null, "activation": "softmax", "name": "dense_4", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "units": 29, "use_bias": true, "bias_regularizer": null, "trainable": true}, "class_name": "Dense"}], "backend": "tensorflow", "keras_version": "2.1.1", "class_name": "Sequential"}