{"config": [{"config": {"filters": 32, "dtype": "float32", "dilation_rate": [1, 1], "name": "conv2d_22", "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "data_format": "channels_first", "kernel_constraint": null, "strides": [1, 1], "bias_regularizer": null, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "trainable": true, "activation": "relu", "padding": "valid", "use_bias": true, "batch_input_shape": [null, 1, 41, 41], "kernel_size": [3, 3]}, "class_name": "Conv2D"}, {"config": {"filters": 32, "kernel_constraint": null, "dilation_rate": [1, 1], "name": "conv2d_23", "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "data_format": "channels_first", "strides": [1, 1], "use_bias": true, "bias_regularizer": null, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [3, 3], "trainable": true, "activation": "relu", "padding": "valid", "activity_regularizer": null, "bias_constraint": null}, "class_name": "Conv2D"}, {"config": {"name": "max_pooling2d_17", "data_format": "channels_first", "padding": "valid", "pool_size": [2, 2], "trainable": true, "strides": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"noise_shape": null, "seed": null, "trainable": true, "name": "dropout_21", "rate": 0.25}, "class_name": "Dropout"}, {"config": {"name": "flatten_16", "trainable": true}, "class_name": "Flatten"}, {"config": {"kernel_constraint": null, "name": "dense_32", "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "bias_regularizer": null, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "trainable": true, "activation": "relu", "units": 512, "use_bias": true}, "class_name": "Dense"}, {"config": {"noise_shape": null, "seed": null, "trainable": true, "name": "dropout_22", "rate": 0.5}, "class_name": "Dropout"}, {"config": {"kernel_constraint": null, "name": "dense_33", "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "bias_regularizer": null, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "trainable": true, "activation": "softmax", "units": 26, "use_bias": true}, "class_name": "Dense"}], "keras_version": "2.1.1", "class_name": "Sequential", "backend": "tensorflow"}