{"backend": "tensorflow", "config": [{"config": {"kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "kernel_size": [5, 5], "filters": 64, "padding": "valid", "activation": "relu", "use_bias": true, "bias_constraint": null, "kernel_constraint": null, "bias_regularizer": null, "batch_input_shape": [null, 1, 28, 28], "dtype": "float32", "dilation_rate": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "trainable": true, "data_format": "channels_first", "strides": [1, 1], "name": "conv2d_3", "kernel_regularizer": null}, "class_name": "Conv2D"}, {"config": {"padding": "valid", "pool_size": [2, 2], "trainable": true, "data_format": "channels_first", "strides": [2, 2], "name": "max_pooling2d_3"}, "class_name": "MaxPooling2D"}, {"config": {"rate": 0.2, "trainable": true, "noise_shape": null, "seed": null, "name": "dropout_3"}, "class_name": "Dropout"}, {"config": {"trainable": true, "name": "flatten_3"}, "class_name": "Flatten"}, {"config": {"kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "activation": "relu", "use_bias": true, "bias_constraint": null, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "trainable": true, "units": 180, "bias_regularizer": null, "name": "dense_5", "kernel_regularizer": null}, "class_name": "Dense"}, {"config": {"kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "activation": "softmax", "use_bias": true, "bias_constraint": null, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "trainable": true, "units": 3, "bias_regularizer": null, "name": "dense_6", "kernel_regularizer": null}, "class_name": "Dense"}], "class_name": "Sequential", "keras_version": "2.1.1"}